app/controllers/climbs_controller.rb

    def index
        @climbs = Climb.all
---
SELECT "climbs".* FROM "climbs"