app/controllers/user_climbs_controller.rb

    def index
        user_climbs = UserClimb.all
---
SELECT "user_climbs".* FROM "user_climbs"

    def create
        user_climb = UserClimb.create(user_climb_params)
---
INSERT INTO "user_climbs" ("user_id", "climb_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["climb_id", 2], ["created_at", "2020-12-16 00:00:56.682816"], ["updated_at", "2020-12-16 00:00:56.682816"]]

    def destroy
        user_climb = UserClimb.find(params[:id])
        user_climb.destroy
---
SELECT "user_climbs".* FROM "user_climbs" WHERE "user_climbs"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "user_climbs" WHERE "user_climbs"."id" = $1  [["id", 4]]