app/controllers/users_controller.rb

INSERT INTO "users" ("name", "username", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "XMAS"], ["username", "Reid"], ["password", "123"], ["created_at", "2020-12-15 19:42:03.464318"], ["updated_at", "2020-12-15 19:42:03.464318"]]
---
    def create
        @user = User.create(user_params)